package com.example.matrix

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.TextView

class MatrixActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_matrix)

        val textView = findViewById<TextView>(R.id.textView2)
        textView.text = "1⃣ معرفی و آموزش مشاغل پردرآمد و آینده دار از جمله: ترید کردن،برنامه نویسی وب سایت،طراحی نرم افزار تلفن همراه،سرمایه گذاری در بازار ارزهای دیجیتال،یوتیوبر شدن، بلاگری،ادیتور فیلم و ویدیو،آهنگسازی،هوش مصنوعی و ... و همچنین معرفی و آموزش شغل های صنعتی مانند بسته بندی حبوبات،قالی بافی،جوشکار سیار،سبزی خرد کن،طراح لباس و خیاطی،پرورش و فروش گل و گیاه و بازاریابی و ...\n" +
                "\uD83D\uDD39با اپلیکیشن ماتریکس می توانید بدون نیاز به سرمایه اولیه کار مورد علاقه ی خود را انتخاب و یاد بگیرید و در کوتاه ترین زمان به درآمد مناسبی برسید.\n" +
                "\n" +
                "2⃣ با معرفی نکات مهم پولسازی و تجارت،قوانین موفقیت،قوانین قدرت،نکات مهم کسب و کار برای تمامی سنین و همچنین قوانین کنترل ذهن و ... به شما کمک میکنیم که بتوانید در مسیر موفقیت در زندگی گام بردارید و هر جنبه ای از زندگی خود را یک گام بهبود ببخشید.\n" +
                "\n" +
                "3⃣ - پکیج کامل ( ۶ دوره کاربردی اندروتیت ) •\n" +
                "\n" +
                "\uD83E\uDDE0 - Iron Mind | ذهن آهنین \uD83E\uDDE0\n" +
                "\uD83C\uDFC6 - G Course | جی کورس \uD83C\uDFC6\n" +
                "\uD83D\uDCB5 - HustlersUniversity | دانشگاه پولسازی\n" +
                "\uD83C\uDFAF - Body Language | زبان بدن \uD83C\uDFAF\n" +
                "\uD83D\uDC8E - Networking | شبکه سازی \uD83D\uDC8E\n" +
                "\uD83D\uDCAA\uD83C\uDFFB - Fitness | تناسب اندام \uD83D\uDCAA\uD83C\uDFFB\n" +
                "\n" +
                "‼️ - تمامی دوره ها با زیرنویس فارسی چسبیده هستند !\n" +
                "\n" +
                "4⃣ توصیه هایی از موفق ترین و مشهور ترین افراد در سراسر دنیا و خدمات متنوع و کاربردی دیگر که بزودی مشاهده می کنید.\n" +
                "\n" +
                "\uD83D\uDCF1سعی کرده ایم اپلیکیشن را در ساده ترین حالت ممکن بسازیم تا شما عزیزان بدون هیچ مشکلی و با کمترین هزینه از خدمات متنوع آن بهره مند شوید.\n" +
                "\n" +
                "آموزش خرید نسخه کامل برنامه:\n" +
                "1_ ابتدا با فشردن کلید \"خرید نسخه کامل\" به صفحه پرداخت وارد شوید. 2_ با انتخاب گزینه کیف پول(درگاه بانکی) و فشردن کلید افزایش موجودی و سپس فشردن کلید پرداخت، نسخه کامل و دائمی برنامه را خریداری نموده و از خدمات متنوع آن بهره مند شوید.✅"
    }
}