package com.example.matrix

import android.content.Context
import android.content.Intent
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import android.widget.TextView
import androidx.recyclerview.widget.RecyclerView

class RecyclerAdviceAdapter(private val dataAdvice: List<DataModel>,private val context: Context):
RecyclerView.Adapter<RecyclerAdviceAdapter.CustomViewHolderAdvice>(){

    private val adviceDescription = listOf(

        DescriptionModel("بزرگ فکر کنید:میکل\u200Cآنژ بوناروتی (Michelangelo Buonarroti)، هنرمند بزرگ رنسانس می\u200Cگوید: «بزرگ\u200Cترین خطری که ما را تهدید می\u200Cکند بلندپروازی نیست، بلکه پایین بودن و در دسترس بودن اهدافمان است.»تعداد کمی از هنرمندان به\u200Cاندازه میکل\u200Cآنژ تأثیرگذار بوده\u200Cاند. امروزه، با گذشت قرن\u200Cها از مرگ او، هنوز هم آثار او الهام\u200Cبخش بسیاری از مردم است و با آنها ارتباط برقرار می\u200Cکنند. آثار وی شهرت جهانی دارد، کافی است مجسمه او از داود یا نقاشی\u200Cاش در نمازخانه واتیکان را در نظر بگیرید. تصور کنید که او تصمیم نمی\u200Cگرفت یک هنرمند باشد و مسیرش را عوض می\u200Cکرد. تصمیم گرفتن برای یک هنرمند موفق بودن همیشه بسیار سخت است، تصور کنید چه می\u200Cشد اگر میکل\u200Cآنژ تصمیم می\u200Cگرفت این بلندپروازی\u200Cاش را درازای انجام کار آسان\u200Cتری رها کند؟\n" +
                "\n" +
                "اغلب اوقات، مردم تصمیم می\u200Cگیرند رؤیاهای خود را به خاطر مسائلی که واقع\u200Cبینانه\u200Cتر است کنار بگذارند. درواقع آنها رؤیاهایشان را به خاطر کارهای آسان\u200Cتر به فراموشی می\u200Cسپارند. این جمله معروف از میکل\u200Cآنژ خطر چنین دیدگاهی را به ما می\u200Cآموزد. به\u200Cجای داشتن چنین تفکری، بلندپرواز باشید."),
        DescriptionModel("نچه را دوست دارید بیابید و انجام دهید:اپرا وینفری (Oprah Winfrey)، شخص بسیار بزرگ و بانفوذ رسانه می\u200Cگوید:«وقتی می\u200Cفهمی در مسیر موفقیت قرار داری که کاری را که دوست داری انجام دهی، حتی اگر دستمزدی بابت آن دریافت نکنی.»بهتر است این نقل\u200Cقول را هنگام کار کردن به یادآورید و به آن فکر کنید. تصور کنید که در کار فعلی خود امکان موفق شدن را دارید. در این صورت، احتمالاً سخت\u200Cتر تلاش خواهد کرد و این تلاش قطعاً بیشتر وقت شما را به خودش اختصاص می\u200Cدهد. اگر از شغلتان متنفرید، پس موفق بودن در آن فقط به معنای پر کردن زندگی\u200Cتان با چیزی است که از انجام آن بیزارید. این کار چه احساسی به شما می\u200Cدهد؟\n" +
                "\n" +
                "در عوض چرا بر انجام کاری که عاشقش هستید، تمرکز نکنید؟ هنگامی\u200Cکه علاقه\u200Cمندی\u200Cتان را یافتید، انگیزه لازم برای ادامه مسیر را پیدا خواهید کرد. موفقیت در این کار، به معنای تحقق رؤیاهایتان است.\n" +
                "\n" +
                "حتی اگر در شغلتان موفق نباشید، حداقل زندگی\u200Cتان را صرف کار مورد علاقه\u200Cتان کرده\u200Cاید. بسیاری از نوازندگان موفق سال\u200Cهایی از زندگی خود را صرف اجراهای بدون دستمزد کرده\u200Cاند، تنها دلیلی که نوازندگی را ادامه داده\u200Cاند عشق به کارشان بوده است."),
        DescriptionModel("ایجاد تعادل در زندگی را یاد بگیرید:فیل نایت (Phil Knight)، مدیرعامل شرکت نایک می\u200Cگوید: «در زندگی شخصی و کاری همیشه جنگ میان آرامش و آشفتگی برقرار است که هیچ\u200Cیک از آنها پیروز نمی\u200Cشود؛ اما چگونگی مدیریت هردوی آنها، رمز موفقیت در زندگی است.»اکثر اوقات، مردم فکر می\u200Cکنند برای موفق بودن، باید فقط آن را هدف زندگی\u200Cشان قرار دهند و به هیچ\u200Cچیز دیگری توجه نکنند. اگر افراد فکر کنند که شغلشان آنها را به سمت موفقیت سوق می\u200Cدهد، احتمالاً هر روز ساعات بی\u200Cشماری را صرف انجام آن کار کنند. به\u200Cهرحال، هزینه این کار، محروم شدن از استراحت کافی، سلامتی و داشتن یک زندگی لذت\u200Cبخش است. درنهایت ممکن است افراد در راه رسیدن به موفقیت خسته شوند و توقف کنند.\n" +
                "\n" +
                "اگر موفقیت برای آنها به معنای داشتن یک زندگی قوی اجتماعی و گروهی از دوستان خوب باشد، احتمالا به شغلشان آسیب می\u200Cرسد؛ به این معنا که ممکن است شغل خود را از دست بدهند و درنتیجه\u200C آن، از عهده مخارج وقت\u200Cگذرانی با دوستان برنیایند. بدین ترتیب، همان\u200Cطور که فیل نایت می\u200Cگوید، موفقیت با کمک تعادل به دست می\u200Cآید. آن را به\u200Cعنوان تعادلی بین کار و استراحت در نظر بگیرید."),
        DescriptionModel("از شکست نترسید:هنری فورد(Henry Ford)، مؤسس شرکت خودروسازی فورد می\u200Cگوید: «شکست به\u200Cسادگی فرصتی برای شروع دوباره است تا این بار هوشمندانه\u200Cتر عمل کنید.»داستانی وجود دارد که واقعی بودن آن تأیید نشده است، اما پیامی که درون آن است دست\u200Cکمی از حقیقت ندارد: توماس ادیسون لامپ را پس از صدها تلاش ناموفق اختراع کرد. در مصاحبه\u200Cای از او پرسیدند: «پس از صدها تلاش ناموفقت چه احساسی داشتی؟» پاسخ او عالی بود: «من صدها بار شکست نخوردم، بلکه صدها راه پیدا کردم که با آنها نمی\u200Cشود لامپ اختراع کرد.»\n" +
                "\n" +
                "هر شکست برای او به\u200Cمنزله یک درس جدید بود. درسی که به او آموخت که چه\u200Cکاری بی\u200Cنتیجه و در عوض کدام کار درست است.\n" +
                "\n" +
                "هر تلاش ناموفق و هر شکست، گامی اساسی در مسیر موفقیت است. تسلیم شدن پس از شکست کار آسانی است که اکثر ما انجام می\u200Cدهیم، اما باید آن را به\u200Cعنوان یک درس در نظر بگیریم. به شکست\u200Cهای خود توجه کنید و آنها را بررسی کنید. در این صورت رمز رسیدن به موفقیت را خواهید آموخت."),
        DescriptionModel("برای رسیدن به موفقیت مصمم باشید:کلنل ساندرز(Colonel Harland David Sanders)، بنیان\u200Cگذار KFC می\u200Cگوید: «من تصمیم گرفتم کاری را به سرانجام برسانم. نه ساعت کاری\u200Cام و نه مقدار پولی که می\u200Cگرفتم هیچ\u200Cکدام باعث نشد تا من بهترین خودم را به نمایش نگذارم. از آن زمان تاکنون همیشه این کار را انجام داده\u200Cام و می\u200Cدانم که برنده بوده\u200Cام.»\n" +
                "\nاین نقل\u200Cقول هم در مواقع شکست درسی برای شما به همراه دارد. ساده\u200Cترین کار در جهان این است که بعد از هر تلاش ناموفق، آن کار را رها کنید. تنها چیزی که شما را به ادامه دادن مسیر تشویق می\u200Cکند، اشتیاقی درونی است که باعث می\u200Cشود رؤیاهایتان را فراموش نکنید و از اهدافتان منصرف نشوید.\n" +
                "\n" +
                "اگر واقعاً به موفقیت متعهد نباشید، پس از هر شکست آسیب بیشتری می\u200Cبینید و هر مانعی سرعت شما را کم می\u200Cکند. بدیهی است که رسیدن به موفقیت سخت است؛ بدون اشتیاق درونی برای آن، نمی\u200Cتوان بر این دشواری غلبه کرد؛ اما در صورت داشتن شور و اشتیاق، این سختی\u200Cها تنها حکم یک مانع را خواهد داشت."),
        DescriptionModel("دست به عمل بزنید:لئوناردو داوینچی یکی از نوابغ رنسانس می\u200Cگوید: «مدت\u200Cهاست به این موضوع توجه می\u200Cکنم که افراد موفق به\u200Cندرت عقب\u200Cنشینی می\u200Cکنند و اجازه نمی\u200Cدهند اتفاقات سد راهشان شوند، بلکه خودشان دست\u200Cبه\u200Cکار می\u200Cشوند و اتفاقات را رقم می\u200Cزنند.»این سخن او مربوط به صدها سال پیش است، اما هنوز هم برایمان کاربردی است، به\u200Cطوری\u200Cکه به معنای واقعی کلمه راجع به\u200Cتمامی افراد صدق می\u200Cکند. به سخن او فکر کنید و شخصی مانند ویلیام شکسپیر را در نظر بگیرید: وقتی به دوران زندگی او فکر می\u200Cکنیم، فقط او در ذهنمان برجسته می\u200Cشود. وقتی به دوران رنسانس در ایتالیا فکر می\u200Cکنیم، به یاد میکل\u200Cآنژ و لئوناردو داوینچی می\u200Cافتیم؛ و در دوران معاصر، بیل گیتس و استیو جابز افراد موفقی هستند که در ذهنمان نقش بسته\u200Cاند. اگر آنها آنچه را می\u200Cخواستند انجام نمی\u200Cدادند، زندگی ما به\u200Cطور غیرقابل قیاسی متفاوت می\u200Cشد. احتمالاً این مقاله را توسط دستگاهی می\u200Cخوانید که افرادی مثل آنها یا شرکت\u200Cهایی که مؤسس آن بوده\u200Cاند، ساخته\u200Cاند.\n" +
                "\n" +
                "همه این افرادی که نامشان ذکر شد در دوران خود، پیشگام بوده\u200Cاند، آنها راهی متفاوت برای حل مسائل پیدا کرده\u200Cاند و آن را انجام داده\u200Cاند. اگر این افراد به\u200Cجای این\u200Cکه دنیا را شکل دهند اجازه داده بودند دنیا آنها را شکل دهد، اصلاً به چشم نمی\u200Cآمدند.\n" +
                "\n" +
                "از حرکت کردن خلاف جهت آب واهمه نداشته باشید. اگر راه بهتری برای حل مسائل به ذهنتان می\u200Cرسد، آن را به اجرا درآورید. اگر موفق نشدید، دوباره تلاش کنید."),
        DescriptionModel("برای موفق بودن باید روابط مثبت ایجاد کنید:تئودور روزولت (Theodore Roosevelt)، بیست و ششمین رئیس\u200Cجمهور آمریکا می\u200Cگوید: «مهم\u200Cترین ماده در فرمول موفقیت، دانستن چگونگی همراهی با مردم است.»بهترین رهبران و برخی از افراد بانفوذ (ازجمله تئودور روزولت که یکی از بهترین رهبران و تأثیرگذارترین افرادی بود که دنیا به خودش دید)، باعث ایجاد و اعتراض و آشوب نشدن، با مردم نجنگیدند و به آنها بی\u200Cاعتنا نبودند؛ بلکه با مردمی که در اطرافشان بودند رابطه\u200Cای دوستانه داشتند. چنین افرادی نزد مردم محبوب بودند و مردم انتظار بهترین عملکرد را از آنها داشتند. این کلید رهبری موفق است.\n" +
                "\n" +
                "منطقی است که اگر شخصی شما را دوست داشته باشد، می\u200Cخواهد شما را یاری کند؛ اگر به او پیشنهادی بدهید، با خرسندی آن را می\u200Cپذیرند. اما اگر کسی شما را دوست نداشته باشد، از کمک کردن به شما امتناع می\u200Cورزد و حتی ممکن است در جناح مقابل شما قرار گیرد. علاوه بر این، بهترین ایده این است که همیشه با اطرافیانمان رابطه مثبت داشته باشیم. شما هرگز نمی\u200Cتوانید به\u200Cطور قطعی بگویید که چه کسانی دوست واقعی و پشتیبانتان هستند و در سختی\u200Cها شمارا تنها نمی\u200Cگذارند؛ اما به\u200Cهرحال سعی کنید همیشه به مردم کمک کنید تا در مواقع سختی دوستانی داشته باشید که شمارا یاری کنند."),
        DescriptionModel("از بیان ایده های جدید نترسید:مارک تواین (Mark Twain)، نویسنده معروف می\u200Cگوید: «فرد زمانی موفق می\u200Cشود که ایده\u200Cهایش به مرحله اجرا برسد.»این حقیقت تأسف\u200Cآور است که افراد با جسورانه\u200Cترین ایده\u200Cها، معمولاً مورد بی\u200Cاعتنایی قرار می\u200Cگیرند. اکثر ما از سنین پایین یاد می\u200Cگیریم که مانند بقیه فکر کنیم و دست به عمل بزنیم. این کار برای اجرای نقش\u200Cهای روزمره عالی است، اما برای انجام کارهای متفاوت (تمامی افراد موفق کارهای متفاوت انجام داده\u200Cاند)، باید متفاوت فکر کنید.\n" +
                "\n" +
                "اگر ایده جدیدی دارید، به خاطر این\u200Cکه جدید و متفاوت است آن را از سرتان بیرون نکنید؛ در عوض خوشحال باشید. این ایده عجیب ممکن است همان چیزی باشد که روزی شما را به سمت موفقیت سوق دهد."),
        DescriptionModel("ظرفیت خود را برای رسیدن به موفقیت باور داشته باشید:والت دیزنی (Walter Disney)، مؤسس کمپانی والت دیزنی می\u200Cگوید: «اگر می\u200Cتوانی تصورش کنی، پس حتماً می\u200Cتوانی انجامش دهی.»موفقیت همان چیزی است که می\u200Cتوانید تصور کنید و به آن برسید.\n" +
                "\n" +
                "ممکن است در مسیر رسیدن به اهدافتان با افرادی برخورد کنید که به شما و توانایی\u200Cتان برای رسیدن به موفقیت شک دارند. به\u200Cهیچ\u200Cوجه با آنها و دیدگاهشان همراه نشوید، زیرا لحظه\u200Cای که باورتان از بین برود و متوقف شوید، همان لحظه\u200Cای است که با آرزوهایتان خداحافظی می\u200Cکنید. به رؤیاهایتان ادامه دهید."),
        DescriptionModel("همیشه نگرش ذهنی مثبتتان را حفظ کنید:توماس جفرسون (Thomas Jefferson)، سومین رئیس\u200Cجمهور آمریکا می\u200Cگوید: «هیچ\u200Cچیز نمی\u200Cتواند انسانی با نگرش ذهنی مثبت را از حرکت به\u200Cسوی اهدافش بازدارد، همان\u200Cگونه که هیچ\u200Cچیز روی زمین نمی\u200Cتواند به فردی با نگرش ذهنی منفی کمک کند.»همان\u200Cطور که جفرسون می\u200Cگوید، شما باید به توانایی\u200Cهایتان برای موفقیت اعتماد کنید. این تنها راه برای پرورش ذهنیت درست است.\n" +
                "\n" +
                "افکار مثبت را جایگزین نگرش\u200Cهای منفی\u200Cتان کنید. شما باید به مشکلات نزدیک شوید، نه به\u200Cعنوان موانعی که راهتان را سد می\u200Cکنند، بلکه باید صرفاً به آنها به\u200Cعنوان وظایفی معمولی درراه رسیدن به موفقیت نگاه کنید.\n" +
                "\n" +
                "اگر مثبت بمانید و همیشه به همین شکل فکر کنید، موانع تأثیر عمیقی بر شما نخواهد داشت، تردید مردم شما را دلسرد نخواهد کرد و حتی بزرگ\u200Cترین مشکلات، جزئی به نظر خواهند رسید. درحالی\u200Cکه با ذهنیت منفی و تردید، به\u200Cراحتی متوقف می\u200Cشوید."),
        DescriptionModel("اجازه ندهید ناامیدی شما را از ادامه دادن به مسیر دلسرد کند:آبراهام لینکلن (Abraham Lincoln)، شانزدهمین رئیس\u200Cجمهور آمریکا می\u200Cگوید: «اجازه ندهید هیچ ناامیدی شما را شکار کند، درنهایت می\u200Cبینید که موفقیت سهم شماست.»این \u200Cیک واقعیت انکارناپذیر از سرشت انسان است که همه ما گاهی خودمان را دست\u200Cکم می\u200Cگیریم و به توانایی\u200Cهایمان شک می\u200Cکنیم. در چنین شرایطی اگر دیگران هم همین حس را به ما منتقل کنند، اوضاع بدتر خواهد شد.\n" +
                "\n" +
                "وقتی شک و تردید وجود ما را احاطه می\u200Cکند، بهترین راهی که به ذهنمان می\u200Cرسد، تسلیم شدن است. به تردیدها اهمیت ندهید. اگر ناامیدی به ذهنتان راه یافت و در رسیدن به موفقیت دچار تردید شدید، بهترین راه نادیده گرفتن ناامیدی\u200Cهاست."),
        DescriptionModel("مشتاق سخت کار کردن باشید:جی\u200Cسی پنی(JC Penny)، بنیان\u200Cگذار موسسه پنی می\u200Cگوید: «اگر در کارتان سختکوش\u200Cتر از افراد معمولی نیستید، نباید انتظار رسیدن به موقعیت\u200Cهای بالاتر را نیز داشته باشید.»احتمالاً این جمله را شنیده\u200Cاید که برای رسیدن به موفقیت به یک درصد نبوغ و ۹۹ درصد پشتکار نیاز دارید یا شاید در مورد ایده ۱۰ هزار ساعت هم چیزهایی شنیده باشید. از هر طرف که به این دو مثال نگاه کنید، یک پیام برای شما دارند: موفقیت حاصل سختکوشی است. اگر در مسیر اهدافتان با تمام وجود تلاش نکنید، هرگز موفق نمی\u200Cشوید."),
        DescriptionModel("برای دنبال کردن آنچه میخواهید، به اندازه کافی شجاع باشید:استیو جابز(Steve Jobs)، بنیان\u200Cگذار شرکت اپل می\u200Cگوید: «برای دنبال کردن احساس و شهود خود شجاعت داشته باشید. آنها می\u200Cدانند که دقیقاً به دنبال چه چیزی هستید. هر چیزی غیر از این در اولویت دوم است.»در یونان باستان، گروهی از خردمندان در معبد دلف زندگی می\u200Cکردند. هرکسی می\u200Cخواست آینده\u200Cاش را بداند یا مشورت بگیرد، از فقیرترین افراد جامعه گرفته تا پادشاهان به دیدن آنها می\u200Cرفت. در بالای درگاه معبد نوشته\u200C شده بود «خودت را بشناس».\n" +
                "\n" +
                "اگر به چیزی اعتقاد داشته و به آن تمایل داشته باشید، احتمالاً ایده\u200Cای هم برای رسیدن به آن خواهید یافت. اگر حتی این\u200Cگونه هم نباشد، بازهم ممکن است به\u200Cطور فطری بدانید که چه چیزهایی درراه رسیدن به موفقیت به شما کمک می\u200Cکند و یا چه چیزهایی از مسیر دورتان می\u200Cکند. درست مثل زمانی که به\u200Cطور غریزی خطر را تشخیص می\u200Cدهید حتی اگر همه\u200Cچیز امن به نظر برسد. درنهایت، باید به حس درونی\u200Cتان اعتماد کنید.\n" +
                "\n" +
                "ممکن است متوجه شده باشید که بسیاری از آموخته\u200Cهای بالا مشابه\u200Cاند و بیشترشان بر توسعه روحیه مثبت تأکید دارد. مشخص است که کلید رسیدن به موفقیت، در آنچه آرزویش را دارید، این است که ازلحاظ ذهنی به خواسته\u200Cتان نزدیک شوید. علاوه بر این، اهمیتی ندارد که در کدام مرحله از زندگی به سر می\u200Cبرید، هنوز هم می\u200Cتوانید تغییرات مثبت ایجاد کنید و موفقیت را از آن خود کنید. با انجام دادن این کار، تولدی دوباره را تجربه خواهید کرد."),
        DescriptionModel("وینستون چرچیل می گوید:\" موفقیت هدف نهایی نیست ، شکست همیشگی نیست و شکست ها تشویقی برای ادامه دادن می باشند \" "),
        DescriptionModel("\" شکست با اصالت بهتر از موفقیت تقلبی است.\" "),
        DescriptionModel("کل این دوایس می گوید:\"جاده موفقیت و جاده شکست دقیقاً یکسان هستند. \" "),
        DescriptionModel("هنری دیوید توریو می گوید:\" موفقیت معمولاً نصیب کسانی می شود که بیش از حد به دنبال آن می گردند .\"  "),
        DescriptionModel("جان راکفلر می گوید:\" فرصت ها به وجود نمی آیند و شما باید آن ها را خلق کنید ، پس تسلیم نشوید و برای حرکت به سمت جلو نترسید .\"  "),
        DescriptionModel("توماس جفرسون می گوید:\"هر چقدر سخت تلاش کنیم ، موفقیت بیشتری به ما نزدیک خواهد شد . \"  "),
        DescriptionModel("بورس می گوید:\" دو دسته از انسان ها هستند که به شما می گویند نمی توانید کاری را انجام دهید ، این افراد یا از تلاش شما می ترسند یا از موفقیت شما وحشت دارند . \"  "),
        DescriptionModel("جیم ران می گوید:\" افراد موفق کارهایی را انجام می دهند که افراد ناموفق تمایلی به انجام دادن آن ها ندارند ، هیچ وقت آرزو نکنید که کاش کار ها آسان تر پیش می رفتند و در عوض آرزو کنید که خودتان قوی تر شوید. \" "),
        DescriptionModel("آلبرتی نستن می گوید:\" سعی نکنید که شخص موفقی باشید و به جای آن برای ارزشمند بودن تلاش کنید. \" "),
        DescriptionModel("وینستون چرچیل می گوید:\" هیچ وقت سعی نکنید که برای اثبات موفقیت خود به دیگران تلاش کنید . \"  "),
        DescriptionModel("تونی هسی می گوید:\" از دنبال کردن پول دست بکشید و اجازه دهید که ثروت خودش به دنبال شما بیاید . \" "),
        DescriptionModel("چسترتون می گوید:\" موفقیت به معنای عبور از یک شکست به شکست بعدی می باشد که انگیزه شما را از بین نخواهد برد . \""),
        DescriptionModel("ری کروک می گوید:\" چنانچه تنها برای کسب پول کار کنید، هرگز موفق نخواهید شد، ولی اگر به کاری که انجام می دهید عشق بورزید و همیشه مشتری را در اولویت قرار دهید، موفقیت از آن شما خواهد بود\".  "),
        DescriptionModel("توماس واتسون می گوید:\" آیا مایلید که فرمولی از موفقیت را به شما یاد دهم ؟ این فرمول کاملا ساده است:تعداد شکست های خود را افزایش دهید ، شاید فکر کنید که شکست دشمن موفقیت می باشد اما اصلا این گونه نیست . شاید انگیزه خود را از دست داده باشید اما بهتر است که یادگیری تان را افزایش دهید و به جلو پیش بروید و سعی کنید که دیگر آن اشتباهات را تکرار نکنید و تمام توان خود را به کار بگیرید و به یاد داشته باشید که دقیقا همین جاست که می توانید موفقیت زیادی به دست بیاورید.\" "),
        DescriptionModel("جیم ران می گوید:\" اگر تمایلی به ریسک کردن ندارید، باید همیشه به معمولی زندگی کردن عادت کنید .\" "),
        DescriptionModel("تونی رابینز می گوید:\"افراد موفق همیشه شتاب دارند و هرچقدر موفقیت بیشتری نصیب شما می شود ، یعنی این که سرعت شما در انجام کارها و پیدا کردن موفقیت بیشتر بوده است .\""),
        DescriptionModel("استیو جابز می گوید:\"اگر کمی بیشتر دقت کنید ، می بینید که بیشتر موفقیت ها در نیمه های شب نصیب افراد شده است . \" "),
        DescriptionModel("باراک اوباما می گوید:\" امتحان واقعی این نیست که از ترس ها فرار کنید ، امتحان واقعی این است که از شکست فرار نکنید . باید با شکست مواجه شوید و احساس قدرت خود را افزایش دهید . \" "),
        DescriptionModel("هلن کلر می گوید:\" شخصیت هیچ کس نمی تواند در راحتی و سکوت رشد پیدا کند و افرادی که با سختی زیاد مواجه می شوند ، روح قدرتمند تری دارند و به موفقیت های بیشتری دست پیدا می کنند . \"   "),
        DescriptionModel("بروسلی می گوید:\" موفقیت را می توان در تمرکز بالا خلاصه کرد . \"  "),
        DescriptionModel("کلین پاول می گوید:\" هیچ رازی برای موفقیت وجود ندارد ، بلکه موفقیت نتیجه آمادگی ، سخت کوشی و یاد گرفتن از شکست ها می باشد . \"  "),
        DescriptionModel("جان وودن می گوید:\" هرگز جازه ندهید آنچه قدرت انجامش را ندارید، در آنچه می توانید انجام دهید تداخل ایجاد کند\"  "),
        DescriptionModel("آلبرت اسکویت زر می گوید:\" موفقیت کلید رسیدن به شادی نیست ، شادی کلید رسیدن به موفقیت می باشد و اگر از کاری که در حال انجامش هستید ، لذت می برید شما به موفقیت خواهید رسید . \"  "),
        DescriptionModel("والت دیزنی می گوید:\" اگر می توانید رویا بسازید ، پس توان انجام دادنش را نیز دارید .\" "),
        DescriptionModel("دیوید برینکلی می گوید:\" یک انسان موفق کسی است که روی آجرهایی می خوابد که دیگران به سمت او پرتاب کرده اند . \"  "),
        DescriptionModel("استیو جابز می گوید:\" این را بدانید که زمان شما ارزشمند است، پس آن را هرگز صرف تقلید از زندگی دیگران نکنید\". "),
        DescriptionModel("توماس ادیسون می گوید:\" برای رسیدن به موفقیت باید مطمئن باشیم که می توانیم کارهای بسیاری انجام دهیم و شکست ها زمانی اتفاق می افتند که افراد نمی دانند چقدر در آن لحظه به موفقیت نزدیک هستند . \" "),
        DescriptionModel("چارلز کترینگ می گوید:\" به کار کردن و تلاش ادامه دهید تا در این میان فرصت های بهتری پیدا کنید ، هیچ گاه از کسی نشنیده ام که بدون تلاش کردن به توان به موفقیت رسید . \""),
        DescriptionModel("اندرو تیت می گوید:یک مرد اصلا نباید براش مهم باشه که الان شاد هست یا نه!اگر صبح از خواب بیدار بشه و ناراحت باشه همون کارای روزمره ای رو که وقتی خوشحال بوده رو باید انجام بده.مثل قبل بره باشگاه،برهسر کار.اینکه چه احساسی داره به هیچ وجه نباید روی روال زندگیش تاثیر داشته باشه."),
        DescriptionModel("اندرو تیت میگه:اولین کاری که یک مرد باید انجام بده این هست که به زندگیش نظم بده.باید قوی ترین و پر افتخار ترین ورژن خودش باشه،آدم بدی نباشه،ذاتش رو خوب کنه،همیشه حقیقت رو بگه،باعث افتخار اطرافیانش باشه و همیشه ازشون مراقبت کنه،با همه مودبانه رفتار کنه و هرچقدر که  توان داره پول در بیاره،ورزش کنه و بهترین فرم بدنی رو برای خودش بسازه،افرادی رو پیدا کنه که باهاش هدف های مشترکی دارن.انجام دادن همین کارهای ساده کافیه تا اتفاقای خوبی واسش رقم بزنه.پس سعی کن اون کسی باشی که به زندگیش نظم داده و توی ذهنش با خودش درگیر نیست و افسرده و ناراحت نیست."),
        DescriptionModel("اندرو تیت می گوید:هیچوقت نگویید که بی انگیزه شدم یا حس فلان کار رو ندارم،احساسات رو بزارید واسه دخترا،ما مرد عملیم.اینجوری دنیا آباد شد،اون مرد هایی که آسمان خراش های دنیا رو ساختن قطعا از جونشون ترسیده بودن ولی به هرحال انجامش دادن پس باید تبدیل بشی به مردی که اهل عمله."),
        DescriptionModel("اندرو تیت می گوید:من سختی کشیدم وقتی که تو داشتی استراحت میکردی!پس ما مثل هم نیستیم چون تو تصمیم گرفتی سختی نکشی و استراحت کردی وقتی من جون میکندم،مشکلی نداره اما از من انتظار نداشته باش تو رو با خودم برابر بدونم چون برابر نیستیم."),
        DescriptionModel("اندرو تیت می گوید:سر زنده باش و نفس بکش،هر روز ببخند و لبخند بزن و هرگز اجازه نده انرژی منفی در تو رخنه کنه.میتونن هرچیزی میخوان راجع به تو بگن ولی بهشون بخند بزن.تو یه آدم خوشحالی و یک فرد رقابت طلبی.پس میتونن هرچیزی که میخوان چی بگن یا چیکار کنن چون هرگز نمیتونن حالت رو بد کنن.پس زندگیت رو با همین فرمون ادامه بده تا روزی که میمیری."),
        DescriptionModel("اندرو تیت می گوید:تو به وجود خدا در کنارت نیاز داری.چالش ها در زندگی ممکنه دشوار،متفاوت و طولانی باشن و خدا نسبت به این چالش ها داناست و تو به خدا در کنارت نیاز داری.چطوری میتونی بدون خداوند از پس ززندگیت بر بیای؟راهنمات کیه؟پس بدون دلیل اینکه روحت در عذابه همینه.داری بهترین زندگی رو می کنی اما در اعماق وجودت شب ها وقتی تو آیینه نگاه می کنی میبینی که غمگینی،چون روحت در عذابه.وقتی خداوند یار و یاورت باشه دیگه به هیچ بنده ای نیاز نداری و از هیچکس نمیترسی."),
        DescriptionModel("اندرو تیت می گوید:به عنوان یک مرد زندگی به بردن یا باختن محدود نمیشه،بعضی وقتا زندگی جوری هست که فقط باید بجنگی چه ببری...چه ببازی.پس باید بلند بشی و کاری رو که باید انجام بدی حتی وقتی مطمعنی که هیچ شانسی برای پیروزی نیست.مردونگی واقعی یعنی این.وقتی توی قلبت امید وجود داره شجاع بودن آسونه ولی وقتی امیدها نابود میشن دیگه شجاعت کار هرکسی نیست."),
        DescriptionModel("اندرو تیت می گوید:اصلا کلمه ای به عنوان انگیزه وجود نداره!نمیشه که تا ابد برای انجام کارهایی که مجبوری انجام بدی همش دنبال انگیزه باشی.انگیزه بالاخره از بین میره،تو باید نظم داشته باشی،هدف و برنامه داشته باشی.پس حتی وقتی که حس و حال و انگیزه نداشتی به هر حال کاراتو انجام بده و منظم باش."),
        DescriptionModel("اندرو تیت می گوید:هیچکس به اندازه ای که،خودت برای خودت ارزش میزاری برات ارزش قائل نیست و زندگیشون مهم نیست.ممکنه برای چند نفر واقعا مهم باشی اما هیچ کدوم اونا هم نمیان دستت رو بگیرن و از تخت بلندت کنن یا مجبورت کنن سخت کار کنی و ثرروتمند بشی پس خودت دست به کار شو."),
        DescriptionModel("کتاب از خوب به عالی اثر جیم کالینز")
    )

    inner class CustomViewHolderAdvice(itemView: View): RecyclerView.ViewHolder(itemView){
        val txt = itemView.findViewById<TextView>(R.id.textViewAdviceNumber)
    }

    override fun onCreateViewHolder(parent: ViewGroup, position: Int): CustomViewHolderAdvice {
        return CustomViewHolderAdvice(LayoutInflater.from(parent.context).inflate(R.layout.recycleradvice,parent,false))
    }

    override fun getItemCount(): Int {
        return dataAdvice.count()
    }

    override fun onBindViewHolder(parent: CustomViewHolderAdvice, position: Int) {
        parent.txt.text = dataAdvice[position].name
        parent.txt.setOnClickListener {
            val myIntent = Intent(context,AdviceDetailActivity::class.java)
            myIntent.putExtra("text",adviceDescription[position].desc)
            context.startActivity(myIntent)
        }
    }
}